[
  {
    "slug": "2023-07-08-2nd-post",
    "title": "This is the second post!",
    "date": "2023-07-08",
    "content": "<h1>2nd post</h1>\n<p>This is the second post - just for testing!!</p>\n"
  },
  {
    "slug": "2023-07-08-launching-my-new-portfolio-and-blog",
    "title": "Launching My New Portfolio and Blog",
    "date": "2023-07-08",
    "content": "<h1>Launching My New Portfolio and Blog</h1>\n<p>Hello, world! Welcome to my new portfolio website and blog. I&#39;m excited to share with you what I&#39;ve been working on and the technology stack behind this site.</p>\n<h2>The Project</h2>\n<p>This website serves as both my professional portfolio and a platform for sharing my thoughts and experiences through blog posts. It&#39;s designed to be clean, responsive, and easy to navigate, showcasing my projects and skills while also providing a space for more in-depth content through the blog.</p>\n<h2>Technology Stack</h2>\n<p>The site is built using modern web technologies, focusing on performance and ease of maintenance:</p>\n<ul>\n<li><strong>React</strong>: The core of the site is built with React, allowing for a dynamic and interactive user experience.</li>\n<li><strong>Material-UI</strong>: For styling and components, I&#39;ve used Material-UI to ensure a consistent and professional look across the site.</li>\n<li><strong>Vite</strong>: The project is bundled and built using Vite, which provides lightning-fast builds and hot module replacement during development.</li>\n<li><strong>GitHub Pages</strong>: The site is hosted on GitHub Pages, providing reliable and free hosting directly from my GitHub repository.</li>\n</ul>\n<h2>The Blog System</h2>\n<p>One of the features I&#39;m most excited about is the blog system. It&#39;s designed to be simple yet powerful:</p>\n<ul>\n<li>Blog posts are written in Markdown, allowing for easy content creation and formatting.</li>\n<li>A custom Node.js script processes the Markdown files during the build phase, converting them to HTML and extracting metadata.</li>\n<li>The blog component in React fetches the processed post data and renders it dynamically.</li>\n</ul>\n<p>This system allows me to write posts directly in my code editor (VSCode) and have them automatically integrated into the site when I push changes to GitHub.</p>\n<h2>Deployment</h2>\n<p>The entire site, including this blog post, is automatically built and deployed whenever changes are pushed to the main branch of the GitHub repository. This is handled by a GitHub Actions workflow, making the deployment process seamless and ensuring that the live site is always up to date.</p>\n<h2>Credits</h2>\n<p>I want to give a special shout-out to Claude, the AI assistant from Anthropic, who helped me design and implement this website and blog system. Claude provided guidance on the project structure, component design, and the clever blog post processing system. While the actual coding and content creation was done by me, Claude&#39;s suggestions and explanations were instrumental in bringing this project to life.</p>\n<h2>What&#39;s Next?</h2>\n<p>In the coming weeks and months, I&#39;ll be using this blog to share my thoughts on web development, showcase new projects, and discuss interesting technologies I&#39;m exploring. Stay tuned for more content, and feel free to reach out if you have any questions or just want to connect!</p>\n<p>Thank you for visiting, and I hope you enjoy exploring the site!</p>\n"
  }
]